In [2]:
%load_ext sql
%sql oracle+cx_oracle://hr:oracle@srv2.lan:1521/free

Connecting to 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

**Group by - Rollup (ab) (a) ()**

In [21]:
%%sql
WITH emplo AS 
    (SELECT * FROM EMPLOYEES WHERE JOB_ID IN ('IT_PROG','FI_MGR'))
SELECT job_id, DEPARTMENT_ID, avg(SALARy) , sum(salary)
from emplo E
group by rollup (JOB_ID, DEPARTMENT_ID)

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+---------+---------------+-------------------------------------------+-------------+
|  job_id | department_id |                AVG(SALARY)                | SUM(SALARY) |
+---------+---------------+-------------------------------------------+-------------+
|  FI_MGR |      100      |                   12008                   |    12008    |
| IT_PROG |       60      |                    5760                   |    28800    |
|  FI_MGR |      None     |                   12008                   |    12008    |
| IT_PROG |      None     |                    5760                   |    28800    |
|   None  |      None     | 6801.333333333333333333333333333333333333 |    40808    |
+---------+---------------+-------------------------------------------+-------------+

**Group by - rollup - (ab) ()**

In [20]:
%%sql
WITH emplo AS 
    (SELECT * FROM EMPLOYEES WHERE JOB_ID IN ('IT_PROG','FI_MGR'))
SELECT job_id, DEPARTMENT_ID, avg(SALARy) , sum(salary)
from emplo E
group by rollup ((JOB_ID, DEPARTMENT_ID))

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+---------+---------------+-------------------------------------------+-------------+
|  job_id | department_id |                AVG(SALARY)                | SUM(SALARY) |
+---------+---------------+-------------------------------------------+-------------+
|  FI_MGR |      100      |                   12008                   |    12008    |
| IT_PROG |       60      |                    5760                   |    28800    |
|   None  |      None     | 6801.333333333333333333333333333333333333 |    40808    |
+---------+---------------+-------------------------------------------+-------------+

**Group by - (a) (b)**

In [19]:
%%sql
WITH emplo AS 
    (SELECT * FROM EMPLOYEES WHERE JOB_ID IN ('IT_PROG','FI_MGR'))
SELECT job_id, DEPARTMENT_ID, avg(SALARy) , sum(salary)
from emplo E
group by grouping sets (JOB_ID, DEPARTMENT_ID)

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+---------+---------------+-------------+-------------+
|  job_id | department_id | AVG(SALARY) | SUM(SALARY) |
+---------+---------------+-------------+-------------+
|   None  |      100      |    12008    |    12008    |
|   None  |       60      |     5760    |    28800    |
| IT_PROG |      None     |     5760    |    28800    |
|  FI_MGR |      None     |    12008    |    12008    |
+---------+---------------+-------------+-------------+

**Summary - custom label - grouping**

In [64]:
%%sql
WITH emplo AS 
    (SELECT * FROM EMPLOYEES WHERE JOB_ID IN ('IT_PROG','FI_MGR'))
SELECT 
case when grouping(job_id) = 1 then '[MY SUMMARY LABEL]' else to_char(job_id) end as jobid, 
DEPARTMENT_ID, 
avg(SALARy) , 
sum(salary)
from emplo E
group by rollup (JOB_ID, DEPARTMENT_ID)

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+--------------------+---------------+-------------------------------------------+-------------+
|       jobid        | department_id |                AVG(SALARY)                | SUM(SALARY) |
+--------------------+---------------+-------------------------------------------+-------------+
|       FI_MGR       |      100      |                   12008                   |    12008    |
|      IT_PROG       |       60      |                    5760                   |    28800    |
|       FI_MGR       |      None     |                   12008                   |    12008    |
|      IT_PROG       |      None     |                    5760                   |    28800    |
| [MY SUMMARY LABEL] |      None     | 6801.333333333333333333333333333333333333 |    40808    |
+--------------------+---------------+-------------------------------------------+-------------+

**Grouping id**

In [96]:
%%sql
WITH emplo AS (
    SELECT * FROM EMPLOYEES 
    WHERE JOB_ID IN ('IT_PROG', 'FI_MGR')
)
SELECT  
 GROUPING_ID(JOB_ID),
 GROUPING_ID(JOB_ID, DEPARTMENT_ID),

JOB_ID,
    CASE 
        WHEN GROUPING_ID(DEPARTMENT_ID) != 0 THEN '[TOTAL]'
        ELSE TO_CHAR(DEPARTMENT_ID) 
    END AS DEPARTMENT_ID_LABEL,

    AVG(SALARY) AS AVG_SALARY, 
    SUM(SALARY) AS TOTAL_SALARY

FROM emplo
GROUP BY ROLLUP(JOB_ID, DEPARTMENT_ID)

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+---------------------+-----------------------------------+---------+---------------------+-------------------------------------------+--------------+
| GROUPING_ID(JOB_ID) | GROUPING_ID(JOB_ID,DEPARTMENT_ID) |  job_id | department_id_label |                 avg_salary                | total_salary |
+---------------------+-----------------------------------+---------+---------------------+-------------------------------------------+--------------+
|          0          |                 0                 |  FI_MGR |         100         |                   12008                   |    12008     |
|          0          |                 0                 | IT_PROG |          60         |                    5760                   |    28800     |
|          0          |                 1                 |  FI_MGR |       [TOTAL]       |                   12008                   |    12008     |
|          0          |                 1                 | IT_PROG |       [TOTAL]       |                    5760                   |    28800     |
|          1          |                 3                 |   None  |       [TOTAL]       | 6801.333333333333333333333333333333333333 |    40808     |
+---------------------+-----------------------------------+---------+---------------------+-------------------------------------------+--------------+

In [99]:
%%sql
WITH emplo AS (
    SELECT * FROM EMPLOYEES 
    WHERE JOB_ID IN ('IT_PROG', 'FI_MGR')
)
SELECT JOB_ID, DEPARTMENT_ID, 
       GROUPING_ID(JOB_ID, DEPARTMENT_ID) AS grouping_level
FROM emplo
GROUP BY ROLLUP(JOB_ID, DEPARTMENT_ID)

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+---------+---------------+----------------+
|  job_id | department_id | grouping_level |
+---------+---------------+----------------+
|  FI_MGR |      100      |       0        |
| IT_PROG |       60      |       0        |
|  FI_MGR |      None     |       1        |
| IT_PROG |      None     |       1        |
|   None  |      None     |       3        |
+---------+---------------+----------------+

In [132]:
%%sql
WITH emplo AS (
    SELECT * FROM EMPLOYEES 
    WHERE JOB_ID IN ('IT_PROG', 'FI_MGR')
)
SELECT  
 GROUPING_ID(JOB_ID),
 GROUPING_ID(JOB_ID, DEPARTMENT_ID),

    #  JOB_ID,
    CASE 
        WHEN GROUPING_ID(JOB_ID, DEPARTMENT_ID) = 3 THEN 'TOTAL'
        WHEN GROUPING_ID(JOB_ID, DEPARTMENT_ID) = 2 THEN 'Agg for - ' ||JOB_ID||''
        WHEN GROUPING_ID(JOB_ID, DEPARTMENT_ID) = 1 THEN 'Agg for - '||JOB_ID||''
        ELSE 'No agg - ' || TO_CHAR(JOB_ID) 
    END AS JOB_ID_LABEL,
    # DEPARTMENT_ID,
    CASE 
        WHEN GROUPING_ID(JOB_ID) !=0  AND  GROUPING_ID(JOB_ID, DEPARTMENT_ID) != 0 THEN '[Total]'
        WHEN GROUPING_ID(JOB_ID, DEPARTMENT_ID) != 0 THEN '-'
        ELSE TO_CHAR(DEPARTMENT_ID) 
    END AS DEPARTMENT_ID_LABEL,
    AVG(SALARY) AS AVG_SALARY, 
    SUM(SALARY) AS TOTAL_SALARY

FROM emplo
GROUP BY ROLLUP(JOB_ID, DEPARTMENT_ID)

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+---------------------+-----------------------------------+-------------------+---------------------+-------------------------------------------+--------------+
| GROUPING_ID(JOB_ID) | GROUPING_ID(JOB_ID,DEPARTMENT_ID) |    job_id_label   | department_id_label |                 avg_salary                | total_salary |
+---------------------+-----------------------------------+-------------------+---------------------+-------------------------------------------+--------------+
|          0          |                 0                 |  No agg - FI_MGR  |         100         |                   12008                   |    12008     |
|          0          |                 0                 |  No agg - IT_PROG |          60         |                    5760                   |    28800     |
|          0          |                 1                 |  Agg for - FI_MGR |          -          |                   12008                   |    12008     |
|          0          |                 1                 | Agg for - IT_PROG |          -          |                    5760                   |    28800     |
|          1          |                 3                 |       TOTAL       |       [Total]       | 6801.333333333333333333333333333333333333 |    40808     |
+---------------------+-----------------------------------+-------------------+---------------------+-------------------------------------------+--------------+

**Withing group, keep, pivot**

In [151]:
%%sql
WITH emp AS (
    SELECT * FROM EMPLOYEES 
    WHERE JOB_ID IN ('IT_PROG')
)
select 'Bye, bye: ' || listagg(first_name, ', ') within group (order by 1) as layoffs
from emp

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+-------------------------------------------------+
|                     layoffs                     |
+-------------------------------------------------+
| Bye, bye: Alexander, Bruce, David, Valli, Diana |
+-------------------------------------------------+

In [172]:
%%sql
select listagg(first_name || first_name || first_name || first_name || first_name || first_name || first_name ,', ') within group (order by 1) as layoffs
from EMPLOYEES

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

RuntimeError: (cx_Oracle.DatabaseError) ORA-01489: result of string concatenation is too long
[SQL: select listagg(first_name || first_name || first_name || first_name || first_name || first_name || first_name ,', ') within group (order by 1) as layoffs
from EMPLOYEES]
(Background on this error at: https://sqlalche.me/e/20/4xp6)
If you need help solving this issue, send us a message: https://ploomber.io/community

In [182]:
%%sql
select 
    listagg(
        first_name || first_name || first_name || first_name || first_name || first_name || first_name  
        ,', '
        on overflow truncate 
         ' (...) SORRY TOO LONG. COUNTER: ' WITH COUNT)
    within group (order by 1) as layoffs
from EMPLOYEES

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                 layoffs                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| EllenEllenEllenEllenEllenEllenEllen, SundarSundarSundarSundarSundarSundarSundar, MozheMozheMozheMozheMozheMozheMozhe, ShelliShelliShelliShelliShelliShelliShelli, AmitAmitAmitAmitAmitAmitAmit, ElizabethElizabethElizabethElizabethElizabethElizabethElizabeth, SarahSarahSarahSarahSarahSarahSarah, DavidDavidDavidDavidDavidDavidDavid, LauraLauraLauraLauraLauraLauraLaura, HarrisonHarrisonHarrisonHarrisonHarrisonHarrisonHarrison, HermannHermannHermannHermannHermannHermannHermann, AlexisAlexisAlexisAlexisAlexisAlexisAlexis, AnthonyAnthonyAnthonyAnthonyAnthonyAnthonyAnthony, GeraldGeraldGeraldGeraldGeraldGeraldGerald, NanetteNanetteNanetteNanetteNanetteNanetteNanette, JohnJohnJohnJohnJohnJohnJohn, KellyKellyKellyKellyKellyKellyKelly, KarenKarenKarenKarenKarenKarenKaren, CurtisCurtisCurtisCurtisCurtisCurtisCurtis, PatPatPatPatPatPatPat, JuliaJuliaJuliaJuliaJuliaJuliaJulia, JenniferJenniferJenniferJenniferJenniferJenniferJennifer, LouiseLouiseLouiseLouiseLouiseLouiseLouise, AlbertoAlbertoAlbertoAlbertoAlbertoAlbertoAlberto, BritneyBritneyBritneyBritneyBritneyBritneyBritney, DanielDanielDanielDanielDanielDanielDaniel, KevinKevinKevinKevinKevinKevinKevin, JeanJeanJeanJeanJeanJeanJean, TaylerTaylerTaylerTaylerTaylerTaylerTayler, AdamAdamAdamAdamAdamAdamAdam, LexLexLexLexLexLexLex, KiKiKiKiKiKiKi, GirardGirardGirardGirardGirardGirardGirard, WilliamWilliamWilliamWilliamWilliamWilliamWilliam, DouglasDouglasDouglasDouglasDouglasDouglasDouglas, KimberelyKimberelyKimberelyKimberelyKimberelyKimberelyKimberely, DanielleDanielleDanielleDanielleDanielleDanielleDanielle, NancyNancyNancyNancyNancyNancyNancy, PeterPeterPeterPeterPeterPeterPeter, ShelleyShelleyShelleyShelleyShelleyShelleyShelley, GuyGuyGuyGuyGuyGuyGuy, AlyssaAlyssaAlyssaAlyssaAlyssaAlyssaAlyssa, ValliValliValliValliValliValliValli, SusanSusanSusanSusanSusanSusanSusan, AlexanderAlexanderAlexanderAlexanderAlexanderAlexanderAlexander, CharlesCharlesCharlesCharlesCharlesCharlesCharles, VanceVanceVanceVanceVanceVanceVance, PayamPayamPayamPayamPayamPayamPayam, AlexanderAlexanderAlexanderAlexanderAlexanderAlexanderAlexander, JanetteJanetteJanetteJanetteJanetteJanetteJanette, StevenStevenStevenStevenStevenStevenSteven, SunditaSunditaSunditaSunditaSunditaSunditaSundita, RenskeRenskeRenskeRenskeRenskeRenskeRenske, JamesJamesJamesJamesJamesJamesJames, DavidDavidDavidDavidDavidDavidDavid, DenDenDenDenDenDenDen, JackJackJackJackJackJackJack, JasonJasonJasonJasonJasonJasonJason, StevenStevenStevenStevenStevenStevenSteven, JamesJamesJamesJamesJamesJamesJames, MichaelMichaelMichaelMichaelMichaelMichaelMichael, MatteaMatteaMatteaMatteaMatteaMatteaMattea, RandallRandallRandallRandallRandallRandallRandall, AllanAllanAllanAllanAllanAllanAllan, SamuelSamuelSamuelSamuelSamuelSamuelSamuel, IreneIreneIreneIreneIreneIreneIrene, BruceBruceBruceBruceBruceBruceBruce, KevinKevinKevinKevinKevinKevinKevin, JuliaJuliaJuliaJuliaJuliaJuliaJulia, DianaDianaDianaDianaDianaDianaDiana, DonaldDonaldDonaldDonaldDonaldDonaldDonald, ChristopherChristopherChristopherChristopherChristopherChristopherChristopher, TJTJTJTJTJTJTJ, LisaLisaLisaLisaLisaLisaLisa, KarenKarenKarenKarenKarenKarenKaren, JoshuaJoshuaJoshuaJoshuaJoshuaJoshuaJoshua, RandallRandallRandallRandallRandallRandallRandall, HazelHazelHazelHazelHazelHazelHazel, LuisLuisLuisLuisLuisLuisLuis, TrennaTrennaTrennaTrennaTrennaTrennaTrenna, MichaelMichaelMichaelMichaelMichaelMichaelMichael, NanditaNanditaNanditaNanditaNanditaNanditaNandita, IsmaelIsmaelIsmaelIsmaelIsmaelIsmaelIsmael, JohnJohnJohnJohnJohnJohnJohn, SarathSarathSarathSarathSarathSarathSarath, JohnJohnJohnJohnJohnJohnJohn, LindseyLindseyLindseyLindseyLindseyLindseyLindsey, WilliamWilliamWilliamWilliamWilliamWilliamWilliam, StephenStephenStephenStephenStephenStephenStephen, MarthaMarthaMarthaMarthaMarthaMarthaMartha, PatrickPatrickPatrickPatrickPatrickPatrickPatrick, JonathonJonathonJonathonJonathonJonathonJonathonJonathon,  (...) SORRY TOO LONG. COUNTER: (15) |
+----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

In [184]:
%%sql
SELECT 
    CASE 
        WHEN LENGTH(LISTAGG(first_name, ', ') WITHIN GROUP (ORDER BY first_name)) > 4000 
        THEN SUBSTR(LISTAGG(first_name, ', ') WITHIN GROUP (ORDER BY first_name), 1, 3997) || '...'
        ELSE LISTAGG(first_name, ', ') WITHIN GROUP (ORDER BY first_name)
    END AS employee_names
FROM employees

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
|                                                                                                                                                                                                                                                                                                                                                                                                                            employee_names                                                                                                                                                                                                                                                                                                                                                                                                                           |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+
| Adam, Alana, Alberto, Alexander, Alexander, Alexis, Allan, Alyssa, Amit, Anthony, Britney, Bruce, Charles, Christopher, Clara, Curtis, Daniel, Danielle, David, David, David, Den, Diana, Donald, Douglas, Eleni, Elizabeth, Ellen, Gerald, Girard, Guy, Harrison, Hazel, Hermann, Irene, Ismael, Jack, James, James, Janette, Jason, Jean, Jennifer, Jennifer, John, John, John, Jonathon, Jose Manuel, Joshua, Julia, Julia, Karen, Karen, Kelly, Kevin, Kevin, Ki, Kimberely, Laura, Lex, Lindsey, Lisa, Louise, Luis, Martha, Mattea, Matthew, Michael, Michael, Mozhe, Nancy, Nandita, Nanette, Neena, Oliver, Pat, Patrick, Payam, Peter, Peter, Randall, Randall, Renske, Samuel, Sarah, Sarath, Sean, Shanta, Shelley, Shelli, Sigal, Stephen, Steven, Steven, Sundar, Sundita, Susan, TJ, Tayler, Timothy, Trenna, Valli, Vance, William, William, Winston |
+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+

**Within group - rank etc**

In [191]:
%%sql
WITH emp AS (
    SELECT * FROM EMPLOYEES 
    WHERE JOB_ID IN ('IT_PROG')
)
SELECT *
FROM emp

Running query in 'oracle+cx_oracle://hr:***@srv2.lan:1521/free'

+-------------+------------+-----------+-----------+----------------+---------------------+---------+--------+----------------+------------+---------------+
| employee_id | first_name | last_name |   email   |  phone_number  |      hire_date      |  job_id | salary | commission_pct | manager_id | department_id |
+-------------+------------+-----------+-----------+----------------+---------------------+---------+--------+----------------+------------+---------------+
|     103     | Alexander  |   James   |   AJAMES  | 1.590.555.0103 | 2016-01-03 00:00:00 | IT_PROG |  9000  |      None      |    102     |       60      |
|     104     |   Bruce    |   Miller  |  BMILLER  | 1.590.555.0104 | 2017-05-21 00:00:00 | IT_PROG |  6000  |      None      |    103     |       60      |
|     105     |   David    |  Williams | DWILLIAMS | 1.590.555.0105 | 2015-06-25 00:00:00 | IT_PROG |  4800  |      None      |    103     |       60      |
|     106     |   Valli    |  Jackson  |  VJACKSON | 1.590.555.0106 | 2016-02-05 00:00:00 | IT_PROG |  4800  |      None      |    103     |       60      |
|     107     |   Diana    |   Nguyen  |  DNGUYEN  | 1.590.555.0107 | 2017-02-07 00:00:00 | IT_PROG |  4200  |      None      |    103     |       60      |
+-------------+------------+-----------+-----------+----------------+---------------------+---------+--------+----------------+------------+---------------+